
## Plan Result (prod)




<pre><code>Plan: 23 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]
  * azurerm_key_vault_secret.storage_account_connection_string_secret
  * module.postgresql.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases[&#34;fact&#34;]
  * module.postgresql.azurerm_resource_group.rg[0]
  * module.postgresql.null_resource.set-user-permissions-additionaldbs[&#34;fact&#34;]
  * module.postgresql.random_password.password
  * module.postgresql.terraform_data.trigger_password_reset
  * module.storage_account.azapi_update_resource.defender_settings
  * module.storage_account.azurerm_role_assignment.storage-account-role-assignment[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account.azurerm_storage_account.storage_account
  * module.storage_account.azurerm_storage_container.container[&#34;photos&#34;]
  * module.storage_account.random_string.storage_account_random_string
  * module.storage_account.time_rotating.rotate
  * module.storage_account.time_static.pim_expiry
  * module.storage_account.time_static.pim_start


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/fact-prod/providers/Microsoft.KeyVault/vaults/fact-kv-prod"
      + name                    = "data-api-POSTGRES-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "find-a-court-or-tribunal"
          + "builtFrom"           = "https://github.com/HMCTS/fact-data-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fact-tech"
          + "environment"         = "production"
          + "managedBy"           = "Find a Court or Tribunal"
          + "source"              = "data-api PostgreSQL"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/fact-prod/providers/Microsoft.KeyVault/vaults/fact-kv-prod"
      + name                    = "data-api-POSTGRES-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "find-a-court-or-tribunal"
          + "builtFrom"           = "https://github.com/HMCTS/fact-data-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fact-tech"
          + "environment"         = "production"
          + "managedBy"           = "Find a Court or Tribunal"
          + "source"              = "data-api PostgreSQL"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/fact-prod/providers/Microsoft.KeyVault/vaults/fact-kv-prod"
      + name                    = "data-api-POSTGRES-PASS"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "find-a-court-or-tribunal"
          + "builtFrom"           = "https://github.com/HMCTS/fact-data-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fact-tech"
          + "environment"         = "production"
          + "managedBy"           = "Find a Court or Tribunal"
          + "source"              = "data-api PostgreSQL"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/fact-prod/providers/Microsoft.KeyVault/vaults/fact-kv-prod"
      + name                    = "data-api-POSTGRES-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "find-a-court-or-tribunal"
          + "builtFrom"           = "https://github.com/HMCTS/fact-data-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fact-tech"
          + "environment"         = "production"
          + "managedBy"           = "Find a Court or Tribunal"
          + "source"              = "data-api PostgreSQL"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/fact-prod/providers/Microsoft.KeyVault/vaults/fact-kv-prod"
      + name                    = "data-api-POSTGRES-USER"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "find-a-court-or-tribunal"
          + "builtFrom"           = "https://github.com/HMCTS/fact-data-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fact-tech"
          + "environment"         = "production"
          + "managedBy"           = "Find a Court or Tribunal"
          + "source"              = "data-api PostgreSQL"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.storage_account_connection_string_secret will be created
  + resource "azurerm_key_vault_secret" "storage_account_connection_string_secret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/fact-prod/providers/Microsoft.KeyVault/vaults/fact-kv-prod"
      + name                    = "storage-account-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "find-a-court-or-tribunal"
          + "builtFrom"           = "https://github.com/HMCTS/fact-data-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fact-tech"
          + "environment"         = "production"
          + "managedBy"           = "Find a Court or Tribunal"
          + "source"              = "data-api Storage account"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.postgresql.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
      + administrator_password_wo     = (write-only attribute)
      + auto_grow_enabled             = false
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "fact-data-api-prod"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = false
      + resource_group_name           = "fact-data-api-data-prod"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + storage_tier                  = (known after apply)
      + tags                          = {
          + "application"         = "find-a-court-or-tribunal"
          + "builtFrom"           = "https://github.com/HMCTS/fact-data-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fact-tech"
          + "environment"         = "production"
          + "managedBy"           = "Find a Court or Tribunal"
        }
      + version                       = "16"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "4d0554dd-fe60-424a-be9c-36636826d927"
      + principal_name      = "DTS Platform Operations SC"
      + principal_type      = "Group"
      + resource_group_name = "fact-data-api-data-prod"
      + server_name         = "fact-data-api-prod"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_name      = "jenkins-cftptl-intsvc-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "fact-data-api-data-prod"
      + server_name         = "fact-data-api-prod"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases["fact"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "fact"
      + server_id = (known after apply)
    }

  # module.postgresql.azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "fact-data-api-data-prod"
      + tags     = {
          + "application"         = "find-a-court-or-tribunal"
          + "builtFrom"           = "https://github.com/HMCTS/fact-data-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fact-tech"
          + "environment"         = "production"
          + "managedBy"           = "Find a Court or Tribunal"
        }
    }

  # module.postgresql.null_resource.set-user-permissions-additionaldbs["fact"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS JIT Access fact DB Reader SC"
          + "force_trigger"  = null
          + "name"           = "fact-data-api"
          + "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        }
    }

  # module.postgresql.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.postgresql.terraform_data.trigger_password_reset will be created
  + resource "terraform_data" "trigger_password_reset" {
      + id     = (known after apply)
      + input  = ""
      + output = (known after apply)
    }

  # module.storage_account.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = {
          + properties = {
              + isEnabled                         = false
              + malwareScanning                   = {
                  + onUpload = {
                      + capGBPerMonth = -1
                      + isEnabled     = false
                    }
                }
              + overrideSubscriptionLevelSettings = true
              + sensitiveDataDiscovery            = {
                  + isEnabled = false
                }
            }
        }
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + sensitive_body          = (write-only attribute)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.storage_account.azurerm_role_assignment.storage-account-role-assignment["Storage Blob Data Contributor"] will be created
  + resource "azurerm_role_assignment" "storage-account-role-assignment" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5811f33f-d47a-4132-ad6a-8763fbc13cca"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_account.azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "factsaprod"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "fact-prod"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "application"         = "find-a-court-or-tribunal"
          + "builtFrom"           = "https://github.com/HMCTS/fact-data-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fact-tech"
          + "environment"         = "production"
          + "managedBy"           = "Find a Court or Tribunal"
        }

      + blob_properties (known after apply)

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.storage_account.azurerm_storage_container.container["photos"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type             = "container"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "photos"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "factsaprod"
    }

  # module.storage_account.random_string.storage_account_random_string will be created
  + resource "random_string" "storage_account_random_string" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.storage_account.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.storage_account.time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.storage_account.time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

Plan: 23 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":8,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->